---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetLegendSettings
source: html/6cfa8710-83b5-1619-2a2f-18b24fc6912e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetLegendSettings Method

Get legend settings object from the style.

## Syntax (C#)
```csharp
public AnalysisDisplayLegendSettings GetLegendSettings()
```